#include<iostream>
using namespace std;
int main9(){
	cout << "现在是lean01-9正在运行" << endl;
	//1、算术运算符
	//加减乘除正负，以及取余（取模）%与自然语言没区别，略了
	int a1 = -10;
	int a2 = 3;
	cout << a1 / a2 << endl;//两个整型相除，结果直接取整，不是四舍五入，不是向下取整，而是直接取整数部分
	int a3;
	cout << "请输入a3的值，它将作为10的除数使用" << endl;
	cin >> a3;
	cout << "10/a3=" << 10 / a3 << endl;

	//两个小数不可以取模，只有整型变量可以进行取模运算

	//++和--，前置和后置
	//1、前置递增
	int a4 = 10;
	int a5 = 10;
	++a4;//让变量的值加1
	a5++;//让变量的值加1
	cout << "a4=" << a4 <<"\t" <<"a5=" <<a5<< endl;
	//前置递增，先让变量加1，再使用这个变量。后置递增，先使用这个变量，再让变量加1
	int a = 10;
	int b = ++a * 1205;
	int c = 10;
	int d = c++ * 1205;
	cout << "b=" << b << "\t" << "d=" << d << endl;

	//2、赋值运算符
	//=，+=，-=，*=。/=,%=
	double e = 10;
	e *= 1.205;//e=e*1.205
	cout << "e*=1.205 =" <<e<< endl;


	system ("pause");

	return 0;
}