#include<iostream>
using namespace std;
int main26()
{
	cout << "现在正在运行的是lean01-26" << endl;
	cout << endl;
	//所谓二维数组，其实就是二维向量序列。换句话说，把数列中的每一项改成二维向量，就得到了二维向量序列
	// 二维数组分为行和列。行数最大肯定是2了，不然你叫什么二维数组（二维向量矩阵）
	//二维数组的定义方式：一共有四种，下面一一展示
	//1.数据类型 数组名[行数][列数]；列数其实就是原来说的数组长度
	int arr1[2][3];
	for (int j = 0; j < 2; j++)//一般外层循环打印列数，内存循环打印行数，使得显示出来的和列向量矩阵形式一样
	{
		for (int i = 0; i < 3; i++)
		{
		   arr1[j][i] = i +j+ 1;//1,2 2,3 3,4三个列向量
		   cout << arr1[j][i]<<" ";
	    }
		cout << endl;
	}
	cout << endl;
	//2.数据类型 数组名[行数][列数]={{数据1，数据2},{数据3，数据4}}
	int arr2[2][3] =
	{
		{1,3,5},
		{2,4,6}//C++是自由格式语言，如果是python，不顶格就要报错
	};//注意分号

	for (int j = 0; j < 2; j++)
	{
		for (int i = 0; i < 3; i++)
		{

			cout << arr2[j][i] << " ";
		}
		cout << endl;
	}
	cout << endl;
	//3。数据类型 数组名[行数][列数]={数据1,数据2,数据3,数据4}
	//机器是以先行后列来识别输入的，比如
	int arr3[2][3] = { 1,2,3,4,5,6 };
	
	for (int j = 0; j < 2; j++)
	{
		for (int i = 0; i < 3; i++)
		{

			cout << arr3[j][i] << " ";
		}
		cout << endl;
	}
	cout << endl;
	//4.数据类型 数组名[][列数]={数据1,数据2,数据3,数据4}
	//系统自己根据数据格数判断行数
	int arr4[][3] = { 1,2,3,4,5,6 };//和3一样，也是遵循先行后列的顺序录入
	for (int j = 0; j < 2; j++)
	{
		for (int i = 0; i < 3; i++)
		{

			cout << arr4[j][i] << " ";
		}
		cout << endl;
	}
	cout << endl;
	//int arr5[2][] = { 1,2,3,4,5,6 };//如果是列数省略，计算机就认不出来了
	//for (int j = 0; j < 3; j++)
	//{
	//	for (int i = 0; i < 2; i++)
	//	{

	//		cout << arr5[i][j] << " ";
	//	}
	//	cout << endl;
	//}

	system("pause");
	
	return 0;
}